CREATE TABLE IF NOT EXISTS employees (
    id BIGSERIAL PRIMARY KEY,
    full_name VARCHAR(100) NOT NULL,
    personnel_number INTEGER NOT NULL UNIQUE,
    position BIGINT,

    CONSTRAINT fk_employees_position FOREIGN KEY (position) REFERENCES positions(id) ON DELETE SET NULL
    );

INSERT INTO employees (full_name, personnel_number, position)
VALUES
    ('Иванов Сергей Иванович', 1543, 1),
    ('Смирнов Андрей Петрович', 1544, 2),
    ('Васильев Николай Сергеевич', 1545, 3),
    ('Петров Михаил Александрович', 1546, 4),
    ('Федоров Алексей Дмитриевич', 1547, 1),
    ('Морозов Владимир Николаевич', 1548, 2),
    ('Волков Дмитрий Андреевич', 1549, 1),
    ('Алексеев Павел Владимирович', 1550, 2),
    ('Лебедев Артём Михайлович', 1551, 1),
    ('Семенов Максим Игоревич', 1552, 2),
    ('Павлов Евгений Викторович', 1553, 1),
    ('Степанов Роман Алексеевич', 1554, 2),
    ('Николаев Илья Валерьевич', 1555, 1),
    ('Захаров Виктор Борисович', 1556, 2),
    ('Борисов Олег Константинович', 1557, 1),
    ('Тимофеев Григорий Павлович', 1558, 2),
    ('Макаров Валентин Егорович', 1559, 1),
    ('Чернышов Константин Аркадьевич', 1560, 2),
    ('Ветров Борис Геннадьевич', 1561, 1),
    ('Громов Вадим Андреевич', 1562, 2);
